###############################################################################
# Created by write_sdc
# Sun Dec 10 17:53:58 2023
###############################################################################
current_design cpu
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 100.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_clock_latency -source -min 4.6500 [get_clocks {clk}]
set_clock_latency -source -max 5.5700 [get_clocks {clk}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {mem_instr}]
set_load -pin_load 0.1900 [get_ports {mem_valid}]
set_load -pin_load 0.1900 [get_ports {pcpi_valid}]
set_load -pin_load 0.1900 [get_ports {irq_oeb[3]}]
set_load -pin_load 0.1900 [get_ports {irq_oeb[2]}]
set_load -pin_load 0.1900 [get_ports {irq_oeb[1]}]
set_load -pin_load 0.1900 [get_ports {irq_oeb[0]}]
set_load -pin_load 0.1900 [get_ports {irq_out[3]}]
set_load -pin_load 0.1900 [get_ports {irq_out[2]}]
set_load -pin_load 0.1900 [get_ports {irq_out[1]}]
set_load -pin_load 0.1900 [get_ports {irq_out[0]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[31]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[30]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[29]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[28]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[27]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[26]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[25]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[24]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[23]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[22]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[21]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[20]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[19]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[18]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[17]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[16]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[15]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[14]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[13]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[12]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[11]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[10]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[9]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[8]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[7]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[6]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[5]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[4]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[3]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[2]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[1]}]
set_load -pin_load 0.1900 [get_ports {mem_addr[0]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[31]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[30]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[29]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[28]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[27]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[26]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[25]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[24]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[23]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[22]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[21]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[20]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[19]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[18]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[17]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[16]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[15]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[14]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[13]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[12]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[11]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[10]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[9]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[8]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[7]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[6]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[5]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[4]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[3]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[2]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[1]}]
set_load -pin_load 0.1900 [get_ports {mem_wdata[0]}]
set_load -pin_load 0.1900 [get_ports {mem_wstrb[3]}]
set_load -pin_load 0.1900 [get_ports {mem_wstrb[2]}]
set_load -pin_load 0.1900 [get_ports {mem_wstrb[1]}]
set_load -pin_load 0.1900 [get_ports {mem_wstrb[0]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[31]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[30]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[29]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[28]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[27]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[26]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[25]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[24]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[23]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[22]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[21]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[20]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[19]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[18]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[17]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[16]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[15]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[14]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[13]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[12]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[11]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[10]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[9]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[8]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[7]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[6]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[5]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[4]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[3]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[2]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[1]}]
set_load -pin_load 0.1900 [get_ports {pcpi_insn[0]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[31]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[30]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[29]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[28]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[27]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[26]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[25]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[24]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[23]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[22]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[21]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[20]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[19]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[18]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[17]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[16]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[15]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[14]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[13]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[12]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[11]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[10]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[9]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[8]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[7]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[6]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[5]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[4]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[3]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[2]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[1]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs1[0]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[31]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[30]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[29]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[28]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[27]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[26]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[25]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[24]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[23]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[22]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[21]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[20]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[19]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[18]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[17]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[16]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[15]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[14]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[13]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[12]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[11]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[10]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[9]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[8]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[7]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[6]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[5]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[4]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[3]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[2]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[1]}]
set_load -pin_load 0.1900 [get_ports {pcpi_rs2[0]}]
set_input_transition 0.6100 [get_ports {clk}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 3.0000 [current_design]
set_max_fanout 4.0000 [current_design]
