###############################################################################
# Created by write_sdc
# Sun Dec 10 19:42:04 2023
###############################################################################
current_design simpleuart
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 100.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_clock_latency -source -min 4.6500 [get_clocks {clk}]
set_clock_latency -source -max 5.5700 [get_clocks {clk}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {reg_dat_wait}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[31]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[30]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[29]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[28]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[27]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[26]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[25]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[24]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[23]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[22]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[21]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[20]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[19]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[18]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[17]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[16]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[15]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[14]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[13]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[12]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[11]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[10]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[9]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[8]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[7]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[6]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[5]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[4]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[3]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[2]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[1]}]
set_load -pin_load 0.1900 [get_ports {reg_dat_do[0]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[31]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[30]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[29]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[28]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[27]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[26]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[25]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[24]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[23]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[22]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[21]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[20]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[19]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[18]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[17]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[16]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[15]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[14]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[13]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[12]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[11]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[10]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[9]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[8]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[7]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[6]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[5]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[4]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[3]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[2]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[1]}]
set_load -pin_load 0.1900 [get_ports {reg_div_do[0]}]
set_load -pin_load 0.1900 [get_ports {uart_oeb[1]}]
set_load -pin_load 0.1900 [get_ports {uart_oeb[0]}]
set_load -pin_load 0.1900 [get_ports {uart_out[1]}]
set_load -pin_load 0.1900 [get_ports {uart_out[0]}]
set_input_transition 0.6100 [get_ports {clk}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 3.0000 [current_design]
set_max_fanout 4.0000 [current_design]
