###############################################################################
# Created by write_sdc
# Sun Dec 10 19:44:42 2023
###############################################################################
current_design simple_interconnect
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 100.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_clock_latency -source -min 4.6500 [get_clocks {clk}]
set_clock_latency -source -max 5.5700 [get_clocks {clk}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {mem_ready}]
set_load -pin_load 0.1900 [get_ports {simpleuart_dat_re}]
set_load -pin_load 0.1900 [get_ports {simpleuart_dat_we}]
set_load -pin_load 0.1900 [get_ports {spimem_valid}]
set_load -pin_load 0.1900 [get_ports {gpio_oeb[15]}]
set_load -pin_load 0.1900 [get_ports {gpio_oeb[14]}]
set_load -pin_load 0.1900 [get_ports {gpio_oeb[13]}]
set_load -pin_load 0.1900 [get_ports {gpio_oeb[12]}]
set_load -pin_load 0.1900 [get_ports {gpio_oeb[11]}]
set_load -pin_load 0.1900 [get_ports {gpio_oeb[10]}]
set_load -pin_load 0.1900 [get_ports {gpio_oeb[9]}]
set_load -pin_load 0.1900 [get_ports {gpio_oeb[8]}]
set_load -pin_load 0.1900 [get_ports {gpio_oeb[7]}]
set_load -pin_load 0.1900 [get_ports {gpio_oeb[6]}]
set_load -pin_load 0.1900 [get_ports {gpio_oeb[5]}]
set_load -pin_load 0.1900 [get_ports {gpio_oeb[4]}]
set_load -pin_load 0.1900 [get_ports {gpio_oeb[3]}]
set_load -pin_load 0.1900 [get_ports {gpio_oeb[2]}]
set_load -pin_load 0.1900 [get_ports {gpio_oeb[1]}]
set_load -pin_load 0.1900 [get_ports {gpio_oeb[0]}]
set_load -pin_load 0.1900 [get_ports {gpio_out[15]}]
set_load -pin_load 0.1900 [get_ports {gpio_out[14]}]
set_load -pin_load 0.1900 [get_ports {gpio_out[13]}]
set_load -pin_load 0.1900 [get_ports {gpio_out[12]}]
set_load -pin_load 0.1900 [get_ports {gpio_out[11]}]
set_load -pin_load 0.1900 [get_ports {gpio_out[10]}]
set_load -pin_load 0.1900 [get_ports {gpio_out[9]}]
set_load -pin_load 0.1900 [get_ports {gpio_out[8]}]
set_load -pin_load 0.1900 [get_ports {gpio_out[7]}]
set_load -pin_load 0.1900 [get_ports {gpio_out[6]}]
set_load -pin_load 0.1900 [get_ports {gpio_out[5]}]
set_load -pin_load 0.1900 [get_ports {gpio_out[4]}]
set_load -pin_load 0.1900 [get_ports {gpio_out[3]}]
set_load -pin_load 0.1900 [get_ports {gpio_out[2]}]
set_load -pin_load 0.1900 [get_ports {gpio_out[1]}]
set_load -pin_load 0.1900 [get_ports {gpio_out[0]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[31]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[30]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[29]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[28]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[27]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[26]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[25]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[24]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[23]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[22]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[21]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[20]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[19]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[18]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[17]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[16]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[15]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[14]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[13]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[12]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[11]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[10]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[9]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[8]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[7]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[6]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[5]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[4]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[3]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[2]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[1]}]
set_load -pin_load 0.1900 [get_ports {mem_rdata[0]}]
set_load -pin_load 0.1900 [get_ports {ram_gwenb[3]}]
set_load -pin_load 0.1900 [get_ports {ram_gwenb[2]}]
set_load -pin_load 0.1900 [get_ports {ram_gwenb[1]}]
set_load -pin_load 0.1900 [get_ports {ram_gwenb[0]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[31]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[30]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[29]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[28]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[27]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[26]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[25]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[24]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[23]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[22]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[21]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[20]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[19]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[18]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[17]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[16]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[15]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[14]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[13]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[12]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[11]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[10]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[9]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[8]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[7]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[6]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[5]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[4]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[3]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[2]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[1]}]
set_load -pin_load 0.1900 [get_ports {ram_wenb[0]}]
set_load -pin_load 0.1900 [get_ports {simpleuart_div_we[3]}]
set_load -pin_load 0.1900 [get_ports {simpleuart_div_we[2]}]
set_load -pin_load 0.1900 [get_ports {simpleuart_div_we[1]}]
set_load -pin_load 0.1900 [get_ports {simpleuart_div_we[0]}]
set_load -pin_load 0.1900 [get_ports {spimemio_cfgreg_we[3]}]
set_load -pin_load 0.1900 [get_ports {spimemio_cfgreg_we[2]}]
set_load -pin_load 0.1900 [get_ports {spimemio_cfgreg_we[1]}]
set_load -pin_load 0.1900 [get_ports {spimemio_cfgreg_we[0]}]
set_input_transition 0.6100 [get_ports {clk}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 3.0000 [current_design]
set_max_fanout 4.0000 [current_design]
