###############################################################################
# Created by write_sdc
# Sun Dec 10 18:17:14 2023
###############################################################################
current_design spimemio
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 100.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_clock_latency -source -min 4.6500 [get_clocks {clk}]
set_clock_latency -source -max 5.5700 [get_clocks {clk}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {ready}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[31]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[30]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[29]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[28]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[27]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[26]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[25]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[24]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[23]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[22]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[21]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[20]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[19]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[18]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[17]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[16]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[15]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[14]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[13]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[12]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[11]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[10]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[9]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[8]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[7]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[6]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[5]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[4]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[3]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[2]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[1]}]
set_load -pin_load 0.1900 [get_ports {cfgreg_do[0]}]
set_load -pin_load 0.1900 [get_ports {flash_oeb[5]}]
set_load -pin_load 0.1900 [get_ports {flash_oeb[4]}]
set_load -pin_load 0.1900 [get_ports {flash_oeb[3]}]
set_load -pin_load 0.1900 [get_ports {flash_oeb[2]}]
set_load -pin_load 0.1900 [get_ports {flash_oeb[1]}]
set_load -pin_load 0.1900 [get_ports {flash_oeb[0]}]
set_load -pin_load 0.1900 [get_ports {flash_out[5]}]
set_load -pin_load 0.1900 [get_ports {flash_out[4]}]
set_load -pin_load 0.1900 [get_ports {flash_out[3]}]
set_load -pin_load 0.1900 [get_ports {flash_out[2]}]
set_load -pin_load 0.1900 [get_ports {flash_out[1]}]
set_load -pin_load 0.1900 [get_ports {flash_out[0]}]
set_load -pin_load 0.1900 [get_ports {rdata[31]}]
set_load -pin_load 0.1900 [get_ports {rdata[30]}]
set_load -pin_load 0.1900 [get_ports {rdata[29]}]
set_load -pin_load 0.1900 [get_ports {rdata[28]}]
set_load -pin_load 0.1900 [get_ports {rdata[27]}]
set_load -pin_load 0.1900 [get_ports {rdata[26]}]
set_load -pin_load 0.1900 [get_ports {rdata[25]}]
set_load -pin_load 0.1900 [get_ports {rdata[24]}]
set_load -pin_load 0.1900 [get_ports {rdata[23]}]
set_load -pin_load 0.1900 [get_ports {rdata[22]}]
set_load -pin_load 0.1900 [get_ports {rdata[21]}]
set_load -pin_load 0.1900 [get_ports {rdata[20]}]
set_load -pin_load 0.1900 [get_ports {rdata[19]}]
set_load -pin_load 0.1900 [get_ports {rdata[18]}]
set_load -pin_load 0.1900 [get_ports {rdata[17]}]
set_load -pin_load 0.1900 [get_ports {rdata[16]}]
set_load -pin_load 0.1900 [get_ports {rdata[15]}]
set_load -pin_load 0.1900 [get_ports {rdata[14]}]
set_load -pin_load 0.1900 [get_ports {rdata[13]}]
set_load -pin_load 0.1900 [get_ports {rdata[12]}]
set_load -pin_load 0.1900 [get_ports {rdata[11]}]
set_load -pin_load 0.1900 [get_ports {rdata[10]}]
set_load -pin_load 0.1900 [get_ports {rdata[9]}]
set_load -pin_load 0.1900 [get_ports {rdata[8]}]
set_load -pin_load 0.1900 [get_ports {rdata[7]}]
set_load -pin_load 0.1900 [get_ports {rdata[6]}]
set_load -pin_load 0.1900 [get_ports {rdata[5]}]
set_load -pin_load 0.1900 [get_ports {rdata[4]}]
set_load -pin_load 0.1900 [get_ports {rdata[3]}]
set_load -pin_load 0.1900 [get_ports {rdata[2]}]
set_load -pin_load 0.1900 [get_ports {rdata[1]}]
set_load -pin_load 0.1900 [get_ports {rdata[0]}]
set_input_transition 0.6100 [get_ports {clk}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 3.0000 [current_design]
set_max_fanout 4.0000 [current_design]
